In [22]:
import warnings
warnings.filterwarnings("ignore")

In [23]:
import pandas as pd
df = pd.read_csv("C:/Users/indhu/OneDrive/Desktop/tnea-proj/data/2017-2020.csv")

In [24]:
df.head()

,Year,College Code,College_Name,Branch Code,Branch Name,OC,BC,BCM,MBC,SC,SCA,ST
0,2017,1,"UNIVERSITY DEPARTMENTS OF ANNA UNIVERSITY, CHE...",AI,Agricultural and Irrigation Engg.(SS),196.25,195.25,193.25,194.25,188.75,185.75,175.25
1,2017,1,"UNIVERSITY DEPARTMENTS OF ANNA UNIVERSITY, CHE...",BY,Bio Medical Engg(SS),198.25,197.50,197.25,196.50,193.00,191.75,188.00
2,2017,1,"UNIVERSITY DEPARTMENTS OF ANNA UNIVERSITY, CHE...",CE,Civil Engineering,198.50,198.00,197.50,197.50,196.00,193.50,196.00
3,2017,1,"UNIVERSITY DEPARTMENTS OF ANNA UNIVERSITY, CHE...",CM,Computer Science and Engg.(SS),199.00,198.75,199.00,197.75,193.50,190.50,193.33
4,2017,1,"UNIVERSITY DEPARTMENTS OF ANNA UNIVERSITY, CHE...",CS,Computer Science and Engg.,199.75,199.50,199.50,199.00,197.50,196.25,193.75

In [25]:
castes = list(df.columns[5:])
castes

['OC', 'BC', 'BCM', 'MBC', 'SC', 'SCA', 'ST']

In [26]:
dic = {
   'Year' : [], 
    'College Code' : [], 
    'Branch Code' : [], 
    'Caste':[], 
    'Mark': []
}

new_df = pd.DataFrame(dic)
new_df

Empty DataFrame
Columns: [Year, College Code, Branch Code, Caste, Mark]
Index: []

In [27]:
for index, row in df.iterrows():
    for caste in castes:
        new_df.loc[len(new_df.index)] = [row["Year"], 
                                          row["College Code"], 
                                          row["Branch Code"], 
                                           caste, 
                                           row[caste]
                                          ]

In [28]:
new_df

      Year  College Code Branch Code Caste    Mark
0     2017             1          AI    OC  196.25
1     2017             1          AI    BC  195.25
2     2017             1          AI   BCM  193.25
3     2017             1          AI   MBC  194.25
4     2017             1          AI    SC  188.75
...    ...           ...         ...   ...     ...
1675  2020          1014          EC   BCM   86.00
1676  2020          1014          EC   MBC   86.00
1677  2020          1014          EC    SC   81.00
1678  2020          1014          EC   SCA     NaN
1679  2020          1014          EC    ST     NaN

[1680 rows x 5 columns]

In [29]:
new_df.to_csv("C:/Users/indhu/OneDrive/Desktop/tnea-proj/data/final_data.csv", index=False)

In [30]:
new_df = pd.read_csv("C:/Users/indhu/OneDrive/Desktop/tnea-proj/data/final_data.csv")

In [43]:
mapping_branch = {}
branch = list(new_df["Branch Code"].unique())

for x in range(len(branch)):
    mapping_branch[branch[x]] = x
    
mapping_branch

{0: 0,
 1: 1,
 2: 2,
 3: 3,
 4: 4,
 5: 5,
 6: 6,
 7: 7,
 8: 8,
 9: 9,
 10: 10,
 11: 11,
 12: 12,
 13: 13,
 14: 14,
 15: 15,
 16: 16,
 17: 17,
 18: 18,
 19: 19,
 20: 20,
 21: 21,
 22: 22,
 23: 23,
 24: 24,
 25: 25,
 26: 26,
 27: 27,
 28: 28,
 29: 29,
 30: 30,
 31: 31,
 32: 32,
 33: 33,
 34: 34,
 35: 35,
 36: 36,
 37: 37,
 38: 38,
 39: 39,
 40: 40,
 41: 41}

In [44]:
mapping_caste = {}
caste = list(new_df["Caste"].unique())

for x in range(len(caste)):
    mapping_caste[caste[x]] = x
    
mapping_caste

{0: 0, 1: 1, 2: 2, 3: 3, 4: 4, 5: 5, 6: 6}

In [45]:
def cat2num_encoding(label, mapping):
    # integer representation
    for x in range(len(label)):
        label[x] = mapping[label[x]]
    return label

In [46]:
new_df["Caste"] = cat2num_encoding(new_df["Caste"], mapping_caste)
new_df["Branch Code"] = cat2num_encoding(new_df["Branch Code"], mapping_branch)

In [47]:
new_df.head()

   Year  College Code Branch Code Caste    Mark
0  2017             1           0     0  196.25
1  2017             1           0     1  195.25
2  2017             1           0     2  193.25
3  2017             1           0     3  194.25
4  2017             1           0     4  188.75

In [48]:
from sklearn.multioutput import MultiOutputClassifier
from sklearn.ensemble import RandomForestClassifier

In [51]:
for label, content in new_df.items():
    if pd.api.types.is_numeric_dtype(content):
        if pd.isnull(content).sum():
            #df_tmp[label+"_is_missing"] = pd.isnull(content)
            new_df[label] = content.fillna(content.median())

In [52]:
X = new_df.drop(columns = ["College Code", "Branch Code"])
Y = new_df.drop(columns = ["Year", "Caste", "Mark"])

In [53]:
X.head()

   Year Caste    Mark
0  2017     0  196.25
1  2017     1  195.25
2  2017     2  193.25
3  2017     3  194.25
4  2017     4  188.75

In [54]:
Y.head()

   College Code Branch Code
0             1           0
1             1           0
2             1           0
3             1           0
4             1           0

In [55]:
Y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1680 entries, 0 to 1679
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   College Code  1680 non-null   int64
 1   Branch Code   1680 non-null   object
dtypes: int64(1), object(1)
memory usage: 26.4+ KB

In [56]:
Y["Branch Code"] =Y["Branch Code"].astype('int')

In [57]:
clf = MultiOutputClassifier(RandomForestClassifier()).fit(X, Y)

In [58]:
clf.predict(X[-2:])

array([[5, 5],
       [5, 4]], dtype=int64)